"use strict";
export const CONST = {
    VERSION: "0.1.0",
    DESIGN: {
        THEME: "default"
    },
    DATA: [],


    ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    // 사이트별 모듈에서 상이하게 처리해야 할 부분은 init 에 추가를 하던가? 아니면 새로운 함수를 추가하여 활용한다.
    // INIT : config 값 변경시 사용
    // POST_PROCESS: 해당 모듈의 액션 처리 후 진행해야 할 부분이 있다면 추가, controller에 index이외의 action이 있다면 추가 가능
    // 예시 - init)
    // // 버전은 기본 버전 뒤에 .0부터 올린다.
    // CONST.VERSION = `${CONST.VERSION}.0`;
    // CONST.DATA = {
    //     test: {
    //         code: 'test',
    //         viewPage: ["/login", "/info/index"], //배열이 0개이면, 전체 노출, 페이지 직접 설정시 url 직접 입력(액션까지 필요하면 같이 입력)
    //         use: true,
    //         useTodayClose: true,
    //         fireDay: 1,
    //         title: "모바일 앱 업데이트",
    //         message: `
    //                 보다 안정적인 검사를 위한 안드로이드 앱 업데이트
    //                 <br>
    //                 <br>
    //                 내원하는 환자의 휴대폰에 설치하는 경우에는 안드로이드 Play store에서
    //                 <br> “모비케어”로 검색하여 설치하시면 이용하실 수 있습니다.
    //                 <br>
    //                 <br>
    //                 이미 설치되어 있는 경우 Play store에서 "모비케어"를 겁색해
    //                 <br>
    //                 업데이트를 진행하시기 바랍니다.
    //                 <br>
    //                 <br>
    //                 <br>
    //                 <span style="font-weight: bold;">일시</span>
    //                 <br>
    //                 <br>
    //                 <span style="width:100%;text-align: left; line-height: 1;">\t- 2020년 12월 24일 07시</span>
    //                 <br>
    //                 <br>
    //             `,
    //         now: new Date(),
    //         begin: Date.parse('2021-01-12 00:00:00'),
    //         end: Date.parse('2022-12-31 23:59:59'),
    //         left: "10px",
    //         top: "10px"
    //     }
    // }
    ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    INIT: function() {
        // 아래 영역에 코드 작성
        ///////////////////////////////////////////////////////////////////////////////////////////////////////////////
        ///////////////////////////////////////////////////////////////////////////////////////////////////////////////
    },
    POST_PROCESS: {
        index: function() {
            // 아래 영역에 코드 작성
            ///////////////////////////////////////////////////////////////////////////////////////////////////////////
            ///////////////////////////////////////////////////////////////////////////////////////////////////////////
        }

        // controller에 index이외의 action이 있다면 직접 추가
        ///////////////////////////////////////////////////////////////////////////////////////////////////////////////
        ///////////////////////////////////////////////////////////////////////////////////////////////////////////////
    }
    ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
}
CONST.INIT();